{
  "items": [
    {
      "title": "Gol D. Roger \n\n \"Pirate King\"",
      "url": "http://onepiece.wikia.com/wiki/Gol_D._Roger",
      "snippet": "Known to most as Gold Roger, was the Pirate King, captain of the Roger Pirates, and owner of the legendary treasure known as 'One Piece'.He was also the lover of Portgas D. Rouge and biological father of Portgas D. Ace. \n\nBorn in Loguetown, Roger was famed as the man who did what no one thought possible - conquering the Grand Line. It would seem that he had been around for some time, considering that Brook refers to him as a rookie, more than 50 years before the current storyline. Before he formed his crew, he met Silvers Rayleigh, a young man who was living on a ship he had stolen after his house had burnt down. Roger said that it was a fated meeting and asked Rayleigh to join him. \n\n Unavoidable Fate \n\nTwenty-six years before the start of the story, Roger came down with an incurable disease. He decided to pitch one last journey with his crew into the Grand Line. Upon reaching the lighthouse at Reverse Mountain, at the entrance of the Grand Line, he recruited Crocus as his doctor to keep him alive for 3 years before the completion of his journey. Their journey took them to Skypiea and later Water 7, where the shipwright Tom built them a ship called the Oro Jackson. \n\n Two of the most powerful opponents Roger faced on his journey were Vice Admiral Monkey D. Garp and the pirate Edward 'Whitebeard' Newgate. The former is said to have cornered him many times on the journey, and the latter was the closest rival to his title. It is said that Whitebeard was the only one capable of matching Roger in combat.",
      "image": "http://onepiecegt.it/files//gallerie/tv/Ep_000/078.jpg"
    },
    {
      "title": "Monkey D. Luffy",
      "url": "http://onepiece.wikia.com/wiki/Monkey_D._Luffy",
      "snippet": "Monkey D. Luffy, also known as Straw Hat Luffy and commonly as Straw Hat, is the main protagonist of the anime and manga, One Piece. He is the son of Monkey D. Dragon, the grandson of Monkey D. Garp, the adoptive brother of Portgas D. Ace and Sabo, and the foster son of Curly Dadan. Luffy is a pirate and his lifelong dream is to become the Pirate King by finding the legendary treasure left behind by the late Pirate King, Gol D. Roger. He believes that being Pirate King means having the most freedom in the world. \n\nHe has eaten the Gomu Gomu no Mi, which gives the consumer's body the properties of rubber. As the founder and captain of the Straw Hat Pirates, he is the first member of the crew, as well as one of its top three fighters.",
      "image": "https://s-media-cache-ak0.pinimg.com/originals/70/d5/61/70d561a22158372e0ed1a78067bab724.gif"
    },
    {
      "title": "Straw Hat Pirates",
      "url": "http://onepiece.wikia.com/wiki/Straw_Hat_Pirates",
      "snippet": "The Straw Hat Pirates are a pirate crew that originated from the East Blue, but have various members from different areas. They are the main focus and protagonists of the anime and manga One Piece, and are led by the main protagonist, Monkey D. Luffy. The 'Straw Hats' are named after Luffy's signature hat that was given to him by Red-Haired Shanks, and are first referred to as the Straw Hat Pirates by Smoker in Alabasta. \n\nThe crew sailed on the Going Merry, their first official Straw Hat ship, up until the Water 7 Arc. After the Enies Lobby Arc, they obtain a new ship called the Thousand Sunny. The Straw Hats currently consist of nine members whose combined bounties equal Beli1,570,000,100. Following the events on the Sabaody Archipelago, all nine members were separated from one another. For two years, they trained in relatively isolated locations, becoming stronger for the sake of helping each other. They then reunited and have since become an active and massive force in the New World.",
      "image": "https://k46.kn3.net/taringa/7/C/D/A/6/5/-HakiDelRey-/231.gif"
    },
    {
      "title": "Roronoa Zoro",
      "url": "http://onepiece.wikia.com/wiki/Roronoa_Zoro",
      "snippet": "Also known as 'Pirate Hunter' Zoro, is a pirate and a former bounty hunter. He was the first member to join the Straw Hat Pirates, and, to date, is considered the largest threat and most dangerous member in the crew after Luffy. His fame as a master swordsman and his great strength, along with the actions of his captain, sometimes led others to believe he was the true captain of the crew. He is one of the top three fighters in the crew alongside Luffy and Sanji, and his dream is to become the greatest swordsman in the world. Zoro is regarded as one of twelve pirates who are referred to as the 'Worst Generation' (formerly known as the 'Eleven Supernovas')",
      "image": "http://i.makeagif.com/media/7-15-2015/bvMin0.gif"
    },
    {
      "title": "Sanji",
      "url": "http://onepiece.wikia.com/wiki/Sanji",
      "snippet": "'Black Leg' Sanji, born under the given name Vinsmoke Sanji, is a pirate and the cook of the Straw Hat Pirates, the former sous chef of Baratie, and the third son of the Vinsmoke Family, making him a prince of the Germa Kingdom. He is officially the fifth member of the crew and the fourth to join, doing so at the end of the Baratie Arc. \n\nSince he was born in North Blue, he is the first Straw Hat not to originate from East Blue. He is one of the Monster Trio in the crew alongside Luffy and Zoro. His dream is to find the rumored All Blue, which is where East Blue, West Blue, North Blue, and South Blue meet along with their wildlife, a chef's paradise. He has a bounty of Beli177,000,000, which is only valid if captured alive, per the request of his father.",
      "image": "https://31.media.tumblr.com/ec39bc721fad92f3af90bb6282c3849f/tumblr_inline_ncn7jlPy0q1t1mz7v.gif"
    },
    {
      "title": "Usopp",
      "url": "http://onepiece.wikia.com/wiki/Usopp",
      "snippet": "'God' Usopp is the sniper of the Straw Hat Pirates, and the former captain of the Usopp Pirates. When Usopp was first introduced, he was often (comically) labeled as the 'Liar' of the Straw Hat Pirates, due to the 'Uso' (うそ) in his name meaning 'lie' or 'falsehood'. He was born in Syrup Village, and was first mentioned by Yasopp, his father. He was officially the third (unofficially fourth) member of the crew, and the third to join, and, including Nami and Robin, also the third to rejoin, doing so at the end of the Post-Enies Lobby Arc. \n\nHis original bounty of Beli30,000,000 was credited to his alias and alter-ego 'Sogeking'. He is also considered one of the 'weak' trio of the crew, along with Nami and Chopper. After awakening Kenbunshoku Haki, he became the fourth member of the Straw Hat crew to demonstrate and use a form of Haki. His current bounty, Beli200,000,000, is a huge jump from his original, due to his role as 'God' for saving all those toy slaves in Doflamingo's underground trades; this takes him from the third lowest bounty of the crew to the third highest, jumping past the previous holder, Nico Robin.",
      "image":"http://stream1.gifsoup.com/view1/3141728/usopp-vs-perona-o.gif"
    },
    {
      "title": "Tony Tony Chopper",
      "url": "http://onepiece.wikia.com/wiki/Tony_Tony_Chopper",
      "snippet": "Also known as 'Cotton Candy Lover' Chopper, is the doctor of the Straw Hat Pirates. Chopper is a reindeer that ate a Devil Fruit called the Hito Hito no Mi. He came from Drum Island where he learned how to be a doctor, which also makes him the only member of the Straw Hat Pirates who was born on the Grand Line. He is the sixth member of the crew and the fifth to join Luffy, as well as being the youngest member on board. He has a bounty of Beli100 due to being mistaken for the crew's pet.",
      "image": "http://data.whicdn.com/images/37112521/large.gif"
    },
    {
      "title": "Nami",
      "url": "http://onepiece.wikia.com/wiki/Nami",
      "snippet": "'Cat Burglar' Nami is a pirate and the navigator of the Straw Hat Pirates. She was the third member of the crew and the second to join, doing so during the Orange Town Arc. Later, she left and betrayed the crew during the Baratie Arc, but rejoined at the end of the Arlong Park Arc, after her past and true intentions were revealed. She has a bounty of Beli66,000,000.",
      "image":"http://pa1.narvii.com/5928/97f8266d3b9c00d01a2566d984d588aa3925f0d3_hq.gif"
    },
    {
      "title": "Nico Robin",
      "url": "http://onepiece.wikia.com/wiki/Nico_Robin",
      "snippet": "Also known by her epithet 'Devil Child', is the archaeologist of the Straw Hat Pirates. She was originally introduced as the vice president of Baroque Works and secondary antagonist of the Alabasta Saga, known as Miss All Sunday, before joining the Straw Hats. She is the seventh member of the crew, the sixth to join, and like Nami, is the second to rejoin, doing so near the end of the Enies Lobby Arc. \n\nRobin is also the first member to have once been an antagonist. She ate the Hana Hana no Mi. During the Post-War arc, she became involved with the Revolutionaries for two years. Her dream is to find the Rio Poneglyph which tells the true history. She currently holds a bounty of Beli130,000,000.",
      "image": "https://66.media.tumblr.com/d0e7ff14d40e3e126552b0141dc98d53/tumblr_nlka2jo6rM1rbtyq6o4_500.gif"
    },
    {
      "title": "Brook",
      "url": "http://onepiece.wikia.com/wiki/Brook",
      "snippet": "Soul King\" Brook is the musician of the Straw Hat Pirates. He is a skeleton that the Straw Hats found on board of a ghost ship after drifting into the Florian Triangle. He is a Devil Fruit user who ate the Yomi Yomi no Mi, and is undead, having been brought back into a pseudo-immortal state because of its powers. He is the ninth member of the Straw Hat crew, and the ninth to join Luffy's crew, as well as being the oldest member on board. He is also one of the two swordsmen onboard their current ship, with the other being Roronoa Zoro. He fills the role of the long-awaited musician that Luffy had wanted for his crew ever since his journey began. He currently has a bounty of Beli83,000,000.",
      "image":"http://pa1.narvii.com/5809/0ff87a2a73577567c89e5a96dfde5f20151591a1_hq.gif"
    },
    {
      "title": "Franky",
      "url": "http://onepiece.wikia.com/wiki/Franky",
      "snippet": "'Iron Man' Franky is the shipwright for the Straw Hat Pirates. A cyborg from Water 7, he was originally the leader of the Franky Family, a group of ship dismantlers. He is originally from South Blue, but left 32 years ago as a four-year-old. He was originally named 'Cutty Flam' until he threw away his original name for his nickname per the request of Iceburg to hide his identity.",
      "image":"https://lh3.googleusercontent.com/-I4pCOhfKAHs/VlsmcOJbAmI/AAAAAAAAT0A/wWDz-WkE_CQ/w800-h800/franky_punch_by_tristtrist-d5udwoa.gif"
    },
    {
      "title": "Revolutionary Army",
      "url": "http://onepiece.wikia.com/wiki/Revolutionary_Army",
      "snippet": "The Revolutionary Army is a powerful military organization led by Monkey D. Dragon. They are fighting against the World Government and what it stands for.",
      "image":"http://images6.fanpop.com/image/photos/36400000/One-Piece-image-one-piece-36443357-500-350.jpg"
    },
    {
      "title": "Heart Pirates",
      "url": "http://onepiece.wikia.com/wiki/Heart_Pirates",
      "snippet": "The Heart Pirates are an infamous and notable rookie pirate crew introduced on Sabaody Archipelago around the time the Straw Hat Pirates arrived there two years ago. Their captain, Trafalgar D. Water Law, is a member of The Worst Generation and a former Shichibukai. They are currently in an alliance with the Straw Hat Pirates, Kozuki Family, and Mink Tribe with the goal of taking down Kaido of the Yonko.",
      "image":"https://secure.static.tumblr.com/8d2c91fb63a8680daada4fc2f2e1600f/3xdx5dt/SLbnonkfi/tumblr_static_tumblr_static_4prrys82wrcws8c0w0cs8c44k_640.jpg"
    },
    {
      "title": "Whitebeard Pirates",
      "url": "http://onepiece.wikia.com/wiki/Whitebeard_Pirates",
      "snippet": "The Whitebeard Pirates were formerly one of the strongest pirate crews in the world, as their captain, Whitebeard, was the only pirate to have ever been a match for the Pirate King, Gol D. Roger, in a fight. Whitebeard's crew is segmented into divisions, instead of all under their captain's direct command. The crew has multiple subordinate crews operating in the New World. Following the deaths of Whitebeard and Ace, the remaining members of the crew engaged the Blackbeard Pirates in the Payback War, which ended with the Blackbeard Pirates brutally defeating them, followed by conquering their former territories, with their captain usurping Whitebeard's position in the Yonko. As a result, the crew has lost most of its power and influence. \n\nAfter the timeskip, it is revealed that the remaining crew members and subordinate crews are being hunted down by the Shichibukai Edward Weevil and his mother Bakkin, who self-proclaim themselves as their captain's biological son and lover, to gain his fortune.",
      "image":"http://static.zerochan.net/Whitebeard.Pirates.full.1753467.jpg"
    },
    {
      "title": "Red Hair Pirates",
      "url": "http://onepiece.wikia.com/wiki/Red_Hair_Pirates",
      "snippet": "The Red Hair Pirates is a strong crew ruling in the New World, led by their captain, Red-Haired Shanks, who is one of the Yonko. This crew is responsible for influencing two of the Straw Hat Pirates to become pirates, Monkey D. Luffy and Usopp.",
      "image":"http://4.bp.blogspot.com/-z5eyJ9rSaGw/TVnxd7eJqDI/AAAAAAAAFMg/jMVI0OhI4S0/s1600/red%2Bhair%2Bpirates%2B2.jpg"
    },
    {
      "title": "Roger Pirates",
      "url": "http://onepiece.wikia.com/wiki/Roger_Pirates",
      "snippet": "The Roger Pirates were the crew of the late Pirate King, Gol D. Roger, and was supposedly the only crew to ever reach Raftel, the end of the New World in the Grand Line. They encountered Vice Admiral Garp on several occasions  and were strong rivals to the Whitebeard Pirates.\n\n This was the crew that traveled around the Grand Line together and the things they did were part of legends. They made it as far as Skypiea and the end of the Grand Line, Raftel, on their ship the Oro Jackson. Roger was one of the most famous figures of his day, while the name of their first mate, Silvers Rayleigh, is widely known and famed as well.\n\nIronically, only the captain and the first mate seem to have been remembered while the rest of the crew have apparently faded out of memory, all save those still active like Shanks and Buggy. The first introduction to their crew comes from Buggy, who recalls his days with Shanks as a cabin boy in their crew. Their captain, Roger, is the first character introduced in the series.",
      "image":"http://www.onepiecepaper.com/wp-content/uploads/2016/09/rogerpirates-810x456.jpg"
    },
    {
      "title": "Worst Generation",
      "url": "http://onepiece.wikia.com/wiki/Worst_Generation",
      "snippet": "The Worst Generation is a term that refers to the eleven top rookie pirates, with bounties over Beli100,000,000 who arrived in the Sabaody Archipelago before the Whitebeard War (whom are denoted as the Eleven Supernovas, along with the Yonko, Blackbeard. They are known as such, since most of the major conflicts that have occurred during their rookie year and after the Battle of Marineford seem to revolve around them. As is the case, they are regarded as 'problem children' who appeared between the end of the Golden Age of Pirates and the beginning of the New Age.",
      "image":"https://myanimelist.cdn-dena.com/s/common/uploaded_files/1446997155-a9b80ccac16d2455f98244e5f0ebe256.jpeg"
    },
    {
      "title": "World Government",
      "url": "http://onepiece.wikia.com/wiki/World_Government",
      "snippet": "The World Government is a political organization comprised of the majority of the world at large, ruled by the Gorosei. It was established 800 years ago. The Marines serve as their primary military organization, headed by the Fleet Admiral, while the Cipher Pol operate behind the scenes, either through sabotage, reconnaissance, spying, espionage and/or assassination; their most powerful enemies are largely pirates and revolutionaries. The Commander-in-Chief oversees both the Marines and Cipher Pol as well as the Shichibukai, at least officially, and is second only to the Gorosei. Impel Down serves as the World Government's maximum-security prison. \n\nCollectively serving as the most prominent antagonists in the series, the World Government is largely portrayed as a corrupt entity, particularly through the pitiless use of their absolute justice doctrine and the depravity of the aristocratic World Nobles.",
      "image":"http://vignette1.wikia.nocookie.net/onepiece/images/1/17/The_Admirals_use_Haki.png/revision/latest?cb=20130926151924"
    },
    {
      "title": "Shanks",
      "url": "http://onepiece.wikia.com/wiki/Shanks",
      "snippet": "Commonly known as \"Red Hair\", is the captain of the Red Hair Pirates and one of the Yonko. He is also a former member of the legendary Roger Pirates, the only group to successfully conquer the Grand Line. He is the pirate who inspired Luffy to go on his journey as a pirate. He found the Gomu Gomu no Mi that was accidentally eaten by Luffy.",
      "image":"http://data.whicdn.com/images/47065005/large.gif"
    },
    {
      "title": "Silvers Rayleigh",
      "url": "http://onepiece.wikia.com/wiki/Silvers_Rayleigh",
      "snippet": "Silvers Rayleigh, also known as the \"Dark King\", is the former first mate of the Roger Pirates, known as the \"Right Hand of the Pirate King\". He became a coating mechanic in Sabaody Archipelago at some point after Roger died and the crew was disbanded. He served as Luffy's mentor in the use of Haki during the two year timeskip. He is also the husband of Shakuyaku.",
      "image":"https://media.giphy.com/media/GN0QMY5JdhZtu/giphy.gif"
    },
    {
      "title": "Crocus",
      "url": "http://onepiece.wikia.com/wiki/Crocus",
      "snippet": "Crocus is a doctor and the caretaker of the whale Laboon as well as the overseer of the Twin Capes Lighthouse that guides ships coming down from Reverse Mountain into the Grand Line. Though he was a lighthouse keeper for most of his life, he spent three years as a doctor serving as a part of Gol D. Roger's crew.",
      "image":"http://onepiece-treasurecruise.com/en/wp-content/uploads/c0587.png"
    },
    {
      "title": "Buggy",
      "url": "http://onepiece.wikia.com/wiki/Buggy",
      "snippet": "Buggy the Star Clown is the captain of the Buggy Pirates as well as the co-leader of the Buggyand Alvida Alliance, and a former apprentice of the Roger Pirates. Shortly after the Battle of Marineford, he became a member of the Shichibukai and and the leader of the pirate dispatch organization \"Buggy's Delivery\". He is the main antagonist of the Orange Town Arc and can be considered the secondary antagonist of the Loguetown Arc. He has since become a highly recurring character in the series.",
      "image":"http://pa1.narvii.com/5801/5c1897add38e6c08aca80c745112799e59138aab_hq.gif"
    },
    {
      "title": "Inuarashi",
      "url": "http://onepiece.wikia.com/wiki/Inuarashi",
      "snippet": "Duke Inuarashi is a canine mink and one of the two rulers of the Mokomo Dukedom, dubbed the \"Ruler of Day\" as he rules over the Mokomo Dukedom from 6:00 AM to 6:00 PM. He and Nekomamushi serve as retainers for the Kozuki Family of Wano Country. Alongside Nekomamushi, he was once a member of the Whitebeard Pirates and Roger Pirates, serving under Kozuki Oden. Pedro has claimed he and Nekomamushi must not be allowed to die because \"the world is waiting for them\"",
      "image":"https://pbs.twimg.com/media/CrWcTQ_UkAArljm.jpg"
    },
    {
      "title": "Nekomamushi",
      "url": "http://onepiece.wikia.com/wiki/Nekomamushi",
      "snippet": "Master Nekomamushi is a feline mink and the guardian of the Whale Forest on Zou, dubbed the \"Ruler of Night\" as he rules over the Mokomo Dukedom from 6:00 PM to 6:00 AM. He and Inuarashi serve as retainers for the Kozuki Family of Wano Country Alongside Inuarashi, he was once a member of the Whitebeard Pirates and Roger Pirates, serving under Kozuki Oden. Pedro has claimed that he and Inuarashi must not be allowed to die because \"the world is waiting for them\"",
      "image":"https://65.media.tumblr.com/f5fbec6753efd3fd1986ac1def74eb36/tumblr_obj3jz2z7n1t45pbyo1_500.jpg"
    },
    {
      "title": "Monkey D. Dragon",
      "url": "http://onepiece.wikia.com/wiki/Monkey_D._Dragon",
      "snippet": "Monkey D. Dragon, commonly known simply as \"Dragon the Revolutionary\", is the father of the Straw Hat Pirates Captain Monkey D. Luffy and the son of the Marines hero Monkey D. Garp. He is the infamous leader and founder of the Revolutionary Army who has been attempting to overthrow the World Government. He is the World Government's greatest enemy, and is the most dangerous and most wanted man in the world",
      "image":"http://pa1.narvii.com/5634/afa7cf2ba53e703cb3bad504d8d6dcd5dd43bbb7_hq.gif"
    },
    {
      "title": "Monkey D. Garp",
      "url": "http://onepiece.wikia.com/wiki/Monkey_D._Garp",
      "snippet": "Monkey D. Garp is a Marine vice admiral. He is the father of the infamous Revolutionary Army leader Monkey D. Dragon,the paternal grandfather of Straw Hat Pirates Captain Monkey D. Luffy, and the adoptive grandfather of the late Portgas D. Ace. He took charge of both Coby and Helmeppo's training. \n\nAfter the war, he became a Marine Instructor to train new recruits, though still retaining the rank of vice admiral. Garp is one of the major figures, along with Sengoku, Shiki, and Whitebeard, from the times when the \"Pirate King\" was still alive.",
      "image":"http://images6.fanpop.com/image/photos/36300000/Monkey-D-Luffy-image-monkey-d-luffy-36384673-500-269.gif"
    },
    {
      "title": "Portgas D. Ace",
      "url": "http://onepiece.wikia.com/wiki/Portgas_D._Ace",
      "snippet": "Portgas D. Ace, born as Gol D. Ace and nicknamed \"Fire Fist\" Ace, was the adopted older brother of Luffy and Sabo, and son of the late Pirate King, Gol D. Roger and his lover, Portgas D. Rouge. He was adopted by Monkey D. Garp as wished by Roger to him before his birth. Ace was the 2nd division commander of the Whitebeard Pirates and one-time captain of the Spade Pirates.  \n\nHunted by the World Government for his lineage, Ace was captured and sentenced to death, which resulted in the Battle of Marineford in an all out clash of powers. Ace was freed, but he sacrificed his life to protect his younger brother from Akainu. His death ultimately proved to be the catalyst leading to Luffy to train for two years to become strong enough to protect his friends, paving the way for the second half of the series.",
      "image":"http://static.tumblr.com/7hzmuq3/pO3m5yspg/ace__26_.gif"
    },
    {
      "title": "Portgas D. Rouge",
      "url": "http://onepiece.wikia.com/wiki/Portgas_D._Rouge",
      "snippet": "Portgas D. Rouge was Ace's mother and Gol D. Roger's lover. She was living on Baterilla in South Blue when she was pregnant with Ace before Roger died. She held her pregnancy for twenty months through sheer willpower in order to deceive the world of Ace's connection to the Pirate King. When the child was finally born, Rouge held him in her arms and named him \"Gol D. Ace\". The result of holding Ace for so long however led to her death from exhaustion after giving birth.",
      "image":"https://lalabratinella.files.wordpress.com/2015/05/tumblr_n6xhu2hucq1ssbae2o1_500.gif"
    },
    {
      "title": "Sabo",
      "url": "http://onepiece.wikia.com/wiki/Sabo",
      "snippet": "Sabo is the Revolutionary Army's chief of staff, recognized as the \"No. 2\" of the entire organization, ranking directly under Monkey D. Dragon himself. Next to being the sworn brother of Monkey D. Luffy and Portgas D. Ace, he is of noble descent, the son of Outlook III, as well as via his parents the adopted brother of Stelly, the current king of the Goa Kingdom, whom Sabo has never recognized as such. \n\n At a very young age, Sabo ran away from his noble parents in the Goa Kingdom to live alone in the kingdom's Gray Terminal, and he met and befriended Ace not long after. Five years later (12 before the present storyline), the two became friends with Luffy as well, and the three came to consider themselves \"brothers\", swearing an oath of brotherhood over sake. They also shared the dream to set out to sea as pirates and achieve freedom, Sabo initially planning to do so at age 17. However, after having escaped his parents once more not long after they had caught him and taken him away from his adoptive brothers, Sabo did then already set sail, on his own, but his boat was destroyed by some Celestial Dragon moments later. \n\nHaving been believed to have died from this, Sabo had in truth survived due to Dragon saving him, and he thus joined the Revolutionaries. He had lost most of his memories from that point forward but regained them upon learning of Ace's death at Marineford.",
      "image":"http://38.media.tumblr.com/4a7f8bb252b2c6e5207da165f6213fd2/tumblr_nmcdweIn811r7zf0fo1_500.gif"
    },
    {
      "title": "Coby",
      "url": "http://onepiece.wikia.com/wiki/Coby",
      "snippet": "Coby is a Marine captain who trained together with Helmeppo under Vice Admiral Garp's supervision. He was formerly an involuntary cabin boy for the Alvida Pirates until he was liberated by Luffy, and was one of the first people Luffy befriended on his travels.",
      "image":"https://lh3.googleusercontent.com/-x5xI4bu08To/VfgB2CdnP0I/AAAAAAAAAE0/jtuMV-97MTs/w800-h800/3202324773_1_16_JRBN8Ak5.gif"
    },
    {
      "title": "Helmeppo",
      "url": "http://onepiece.wikia.com/wiki/Helmeppo",
      "snippet": "Lieutenant Commander Helmeppo is a Marine officer and Morgan's son. Once a spoiled child who took advantage of his father's status, he is now a Marine Lieutenant Commander who trained with Coby under Vice Admiral Garp. Due to his actions when he was first introduced, he can be considered a minor antagonist of the Romance Dawn Arc.",
      "image":"https://rei.animecharactersdatabase.com/uploads/chars/5537-1823889150.png"
    },
    {
      "title": "Gorosei",
      "url": "http://onepiece.wikia.com/wiki/Gorosei",
      "snippet": "The Gorosei (literally meaning \"Five Elder Stars\") are the heads of the World Government, and as such, they essentially rule the entire world. They are the five men who rule above the Marines, Cipher Pol, and the ones who made a pact with the Shichibukai, making them one of the main antagonists of the series. So far, none of their names have been revealed.",
      "image":"http://i.ytimg.com/vi/8Vzo4gsvpb4/maxresdefault.jpg"
    },
    {
      "title": "Shichibukai",
      "url": "http://onepiece.wikia.com/wiki/Shichibukai",
      "snippet": "The Shichibukai, the full title being Oka Shichibukai (王下七武海 Ōka Shichibukai?, literally meaning \"Royal Seven Military Seas\"), are seven powerful and notorious pirates who have allied themselves with the World Government.[",
      "image":"https://myanimelist.cdn-dena.com/s/common/uploaded_files/1446581188-ba7bd7f68e3ac987e1c59805491ca0a9.jpeg"
    },
    {
      "title": "World Noble",
      "url": "http://onepiece.wikia.com/wiki/World_Noble",
      "snippet": "The World Nobles, also known as the Celestial Dragons (天竜人 Tenryūbito?, literally meaning \"Heavenly Dragon Folk\"), are the descendants of nineteen of the Twenty Kings who established what is now known as the World Government. The World Nobles — specifically those of Roswald's family — are considered the main antagonists of the Sabaody Archipelago Arc.",
      "image":"http://img1.wikia.nocookie.net/__cb20090706175832/onepiece/es/images/3/3d/800px-Tenryuubito_Silhouette.jpg"
    },
    {
      "title": "Beasts Pirates",
      "url": "http://onepiece.wikia.com/wiki/Beasts_Pirates",
      "snippet": "The Beasts Pirates are a powerful pirate crew ruling in the New World, led by Kaido of the Yonko. They are currently in Wano Country, and serve as one of the main antagonist group of the Zou Arc, and one the central antagonist groups of the Yonko Saga.",
      "image":"https://i.ytimg.com/vi/vepwyf4CTkA/maxresdefault.jpg"
    },
    {
     "title": "Kaido",
     "url": "http://onepiece.wikia.com/wiki/Kaido",
     "snippet": "Kaido of the Beasts is the captain of the Beasts Pirates and one of the Yonko, the third to be mentioned by name, and the last one to debut; he is also known as the \"Strongest Creature in the World\". He and his crew currently occupy Wano Country. He is one of the central antagonists of the Dressrosa Saga and the Yonko Saga, being first referred to by Monkey D. Garp in Water 7 and then directly mentioned by Gekko Moriah shortly after he obtained Monkey D. Luffy's shadow; his  title of Yonko was revealed just after the Straw Hat Pirates defeated Moriah.",
     "image":"https://49.media.tumblr.com/3fe2ac8852db4ada12b177c6dd7030ba/tumblr_o6hm1un7bB1toqmlao9_r2_250.gif"
   },
   {
      "title": "Jack",
      "url": "http://onepiece.wikia.com/wiki/Jack",
      "snippet": "Jack the Drought is a prominent member of the Beasts Pirates, one of the three Disasters who are Kaido's right-hand men, and the captain of the Mammoth. He also has ties with the Underworld. Due to his actions, he is the main antagonist of the Zou Arc and is one of the central antagonists of the Yonko Saga. He was first briefly mentioned when being notified of Caesar Clown's capture by viewers of Caesar's broadcast of the Punk Hazard incident.",
      "image":"https://i.ytimg.com/vi/UzeAa9ZSQlE/maxresdefault.jpg"
    },
    {
      "title": "Yonko",
      "url": "http://onepiece.wikia.com/wiki/Yonko",
      "snippet": "The Yonko are the four most notorious and most powerful pirate captains in the world, but are neither allies nor enemies of one another, preferring to remain autonomous under most circumstances. These four individually reside within the second half of the Grand Line (known as the \"New World\"), exerting impressive influence and control over dozens of other pirate crews and self-governing islands. In the decisive Battle of Marineford, Whitebeard, one of the Yonko, met his end towards the climax of the Whitebeard War. Blackbeard, his killer, subsequently usurped his position. Shanks, another member of the Yonko, arbitrated a ceasefire to end the aforementioned war.",
      "image":"https://s-media-cache-ak0.pinimg.com/564x/e2/cc/02/e2cc023cd6e443618f45018ee048d0c9.jpg"
    },
    {
      "title": "Marshall D. Teach Blackbeard",
      "url": "http://onepiece.wikia.com/wiki/Marshall_D._Teach",
      "snippet": "Marshall D. Teach, also known as Blackbeard, is the admiral of the Blackbeard Pirates and one of the Yonko. He started out his pirate career as a member of the Whitebeard Pirates' 2nd division, until he murdered Thatch, the 4th division commander, for the Yami Yami no Mi and defected. \n\nPrior to the two-year timeskip, he briefly held the position of Shichibukai after handing Ace over to the Marines, before resigning upon returning from Impel Down with Level Six prisoners. Due to his actions, he can be considered the tertiary antagonist of Impel Down Arc, and one of the main antagonists of the Marineford Arc, the Summit War Saga, and the remainder of the series overall.",
      "image":"http://pa1.narvii.com/6126/25076253e2bfc310f62f67f2704516941ffe514e_hq.gif"
    },
    {
      "title": "Donquixote Doflamingo",
      "url": "http://onepiece.wikia.com/wiki/Donquixote_Doflamingo",
      "snippet": "Donquixote Doflamingo, nicknamed \"Heavenly Yaksha\", was the captain of the Donquixote Pirates, a former member of the Shichibukai with a frozen bounty of Beli340,000,000, the former most influential underworld broker under the codename \"Joker\", and is a former World Noble of the Donquixote Family descent. He is the first son of the late Donquixote Homing and the older brother of the late Rosinante, both of whom he killed out of feeling betrayed by them. Doflamingo became the king of Dressrosa after taking the throne from Riku Dold III eight years before the start of the series; he ruled the country tyrannically until he was stripped of his positions as a Shichibukai and king after he was defeated by Monkey D. Luffy near the end of the Dressrosa Arc, being arrested alongside most of his crew members by Admiral Fujitora.  \n\nHe is a major antagonist in the Marineford Arc where he took part in the Battle of Marineford and sided with the Marines, along with most of the other Shichibukai, and the main antagonist of the Dressrosa Arc and the Dressrosa Saga as a whole, being the impetus for the entirety of the saga's events.",
      "image":"http://www.chuing.net/zboard/revol_getimg.php?id=mone1&no=98363&num=2&fc=eef8726fd53ed8d80e21c7f1590b22df"
    },
    {
      "title": "Donquixote Rosinante",
      "url": "http://onepiece.wikia.com/wiki/Donquixote_Rosinante",
      "snippet": "Donquixote Rosinante was formerly a World Noble of the Donquixote Family descent, as the second son of Donquixote Homing and the younger brother of Donquixote Doflamingo. After his family lost their status as Celestial Dragons and became pariahs, Rosinante became an Elite Officer of the Donquixote Pirates, serving under Doflamingo under the codename Corazon.  The truth, however, was that he was a Marine Commander, working undercover in order to stop Doflamingo. He was found out by the former Corazon, Vergo, and was executed by Doflamingo 13 years ago.",
      "image":"https://media.giphy.com/media/3o85xkXogkA7wLsOe4/giphy.gif"
    },
    {
      "title": "Trafalgar D. Water Law",
      "url": "http://onepiece.wikia.com/wiki/Trafalgar_D._Water_Law",
      "snippet": "Trafalgar D. Water Law, more commonly known as just Trafalgar Law and by his epithet as the \"Surgeon of Death\", is the captain and doctor of the Heart Pirates, a pirate crew from North Blue. On top of being one of twelve pirates who are referred to as the \"Worst Generation\" (formerly known as the \"Eleven Supernovas\"), he became one of the Shichibukai during the timeskip, but his position was revoked for allying with the Straw Hat Pirates and bringing down Donquixote Doflamingo. Law, like many other pirates, dreams of finding the One Piece. \n\nDuring the timeskip, his bounty increased from Beli200,000,000 to Beli440,000,000, before it was frozen. After he was expelled from the Shichibukai, Law's bounty was raised to Beli500,000,000.",
      "image":"http://pa1.narvii.com/5844/6f0d25756be0b4cc4b08cf75f4633972863f42fd_hq.gif"
    },
    {
      "title": "Edward Newgate Whitebeard",
      "url": "http://onepiece.wikia.com/wiki/Edward_Newgate",
      "snippet": "Edward Newgate, more commonly known as \"Whitebeard\", was the captain of the Whitebeard Pirates and was known as \"The Strongest Man in the World\" and \"The Man closest to One Piece\" after Gol D. Roger's death. He was a member of the Yonko that ruled over the New World until his death during the Battle of Marineford.",
      "image":"http://data.whicdn.com/images/48160050/large.gif"
    },
    {
      "title": "Caesar Clown",
      "url": "http://onepiece.wikia.com/wiki/Caesar_Clown",
      "snippet": "Caesar Clown, who was referred to as \"Master\" by his subordinates, is a famed scientist, a former colleague of Vegapunk, the main antagonist of the Punk Hazard Arc, and the first main antagonist the Straw Hats face in the New World. He is the leading expert on chemical weapons of mass destruction and has a bounty of Beli300,000,000 on his head. \n\nDuring the Dressrosa Arc, Donquixote Doflamingo declared Caesar to be his direct subordinate, meaning Caesar is a de facto member of the Donquixote Pirates, and thus protected from the law. Upon Doflamingo's defeat and arrest, this protection is lost, and Caesar's criminal status is once again operational in full. After a period as a hostage of the Straw Hat-Heart Pirate Alliance, he is currently in the custody of Big Mom, after Capone Bege was sent to retrieve and escort both him and Sanji to Whole Cake Island.",
      "image":"https://67.media.tumblr.com/6e01fc20f450eb6b5be5ae31f2e2f540/tumblr_mpjygbCy7t1r6hwd2o1_500.gif"
    },
    {
      "title": "Jinbe",
      "url": "http://onepiece.wikia.com/wiki/Jinbe",
      "snippet": "\"Knight of the Sea\" Jinbe is a whale shark fishman, the second captain of the Sun Pirates after Fisher Tiger, and a former Shichibukai, who attained the position eleven years ago. His name was first mentioned by Yosaku, when he was explaining about the Shichibukai. However, he is formally introduced much later, during the Impel Down Arc. He renounced his Shichibukai title at the Battle of Marineford, allying himself with the Whitebeard Pirates. \n\nDuring the war, he befriended Monkey D. Luffy, and later allied with him and his crew to prevent the New Fishman Pirates' coup d'état against the Neptune Royal Family and the Ryugu Kingdom. He was even invited to join the Straw Hat Pirates, but declined due to having unfinished business of still being affiliated with Big Mom; however, he promised that once he was ready, he would return to Luffy again and request to join his crew. Jinbe's first bounty was Beli76,000,000. Eventually, his bounty raised to Beli250,000,000. After he resigned from the Shichibukai, his bounty has been raised to over Beli400,000,000.",
      "image":"http://pa1.narvii.com/6110/6e73114a1457ab8159fa83e3875c2dd62d584b6e_hq.gif"
    },
    {
      "title": "Kin'emon",
      "url": "http://onepiece.wikia.com/wiki/Kin%27emon",
      "snippet": "\"Foxfire Kin'emon\" is a samurai from Wano Country whom the Straw Hat Pirates found in various pieces at Punk Hazard. He is a retainer of the Kozuki Family. He posed as Momonosuke's father after Kozuki Oden's death.",
      "image":"http://i.imgur.com/o6MRt2u.gif"
    },
    {
      "title": "Kozuki Momonosuke",
      "url": "http://onepiece.wikia.com/wiki/Kozuki_Momonosuke",
      "snippet": "Kozuki Momonosuke is an inhabitant of Wano Country and the son of the late daimyo of the Kozuki Family, Kozuki Oden. He ended up on Punk Hazard after stowing away on a ship. He was first mentioned when Kin'emon told Sanji that he came to Punk Hazard to rescue his \"son\". His given name was revealed when the samurai was asking if the captive children in the Biscuits Room had seen him, and the clan name revealed when Kin'emon spoke of the child's true heritage. \n\nIn his first appearance, Momonosuke was seen in his full animal form, an Eastern dragon with a long, pink, slender body. This form has yellow eyes, horns, and scales along his back. In his human form, his appearance matches the stereotype of all samurai found in ancient Japan, with a topknot and the top of his head shaven. As a child, Momonosuke is quite short. Kin'emon used his Devil Fruit ability to give him a pink kimono with peach designs on it, matching his name (\"momo\" means \"peach\" in Japanese.) He also wears a red scarf, a purple obi, and a pair of geta.",
      "image":"https://67.media.tumblr.com/8fb299aa2e95ce216affb2728052956b/tumblr_mxtyt0Plgf1rr37qoo1_500.gif"
    },
    {
      "title": "Curly Dadan",
      "url": "http://onepiece.wikia.com/wiki/Curly_Dadan",
      "snippet": "Curly Dadan is a friend of Monkey D. Garp and the foster mother of Portgas D. Ace and Monkey D. Luffy. Garp entrusted her to take care of Ace shortly after the boy's birth. Later, Garp also left Luffy in Dadan's care. She took care of Sabo too when he moved in. Dadan lives on Mt. Colubo near Foosha Village. She is the Mt. Colubo mountain bandit boss of the Dadan Family and a wanted criminal. Dadan was first mentioned in the Post-Enies Lobby Arc, when Woop Slap read about Luffy and the Straw Hat Pirates waging war on the World Government.",
      "image":"http://66.media.tumblr.com/1daabdd18addb97c61109d593e86d0d9/tumblr_nlhs9coC9q1tjy6spo6_500.gif"
    },
    {
      "title": "Kanjuro",
      "url": "http://onepiece.wikia.com/wiki/Kanjuro",
      "snippet": "\"Evening Shower\" Kanjuro is a samurai from Wano Country. He is a retainer of the Kozuki Family and Kin'emon's fellow samurai who was captured by Doflamingo's crew. Kanjuro ate a Paramecia-class Devil Fruit that allows him to turn anything that is drawn into a three-dimensional real object, or even a living organism by saying \"Appear\". Creations also have the same abilities as the originals, such as a bird's ability to fly, or food being edible (although according to Kin'emon it hurts his stomach). This also allows him to affect his own body, as he hid inside a wall as a drawing to avoid detection. \n\nDue to his lack of knowledge about Devil Fruits, he calls his ability \"sorcery\". The fruit's powers can also work in reverse, causing the animation to revert to its inanimate 2D form if it comes in contact with a flat surface. Kanjuro can also order the drawing to return to its inanimate form.",
      "image":"https://49.media.tumblr.com/74ef6a229ebdb251833dee0312cf34ed/tumblr_nnsyd0sPrN1tuzodbo3_500.gif"
    },
    {
      "title": "Borsalino",
      "url": "http://onepiece.wikia.com/wiki/Borsalino",
      "snippet": "Borsalino, more commonly known by his alias Kizaru, is an admiral in the Marines. He was first mentioned by Robin during the initial encounter with Aokiji. Because of his actions, Kizaru can be considered the secondary antagonist of the Sabaody Archipelago Arc and one of the major antagonists of the Marineford Arc. After Aokiji resigned from the marines and Akainu was promoted to Fleet Admiral, Kizaru is the only remaining admiral from the previous trio.",
      "image":"http://67.media.tumblr.com/ab8329d3bfe1126d86294d745e4f01c5/tumblr_moyjm8iIZj1qbmhdio3_500.gif"
    },
    {
      "title": "Issho",
      "url": "http://onepiece.wikia.com/wiki/Issho",
      "snippet": "Issho alias Fujitora is a Marine admiral. He was, during the two-year timeskip, conscripted to fill one of the two admiral position vacancies following Kuzan leaving the Marines and Sakazuki becoming fleet admiral, whilst Ryokugyu filled the other.Issho was first mentioned by Sakazuki when the latter was first discussing plans to deal with Monkey D. Luffy and Trafalgar Law. \n\nHis following mission and actions on Dressrosa made him the secondary antagonist of the Dressrosa Arc. Much like Kuzan, Issho is strongly against the Marines' dogma of \"Absolute Justice\" and extremely vocal in his opposition of it. His disgust with the corruption and evil in the world is such that he has intentionally blinded himself many years ago so as to avoid ever seeing it again. He particularly holds strong disdain for the Shichibukai system, longing to disestablish it, and after learning about the horrific atrocities comitted by Donquixote Doflamingo of the Shichibukai in Dressrosa, Issho formally apologized to King Riku and his citizens on behalf of the Marines, thus angering Sakazuki and risking his admiral position.",
      "image":"http://pa1.narvii.com/6149/5c34a57a96830ed6ae98941cff18ccf43f145f73_hq.gif"
    },
    {
      "title": "Kuzan",
      "url": "http://onepiece.wikia.com/wiki/Kuzan",
      "snippet": "Kuzan, better known by his epithet Aokiji, is a former Marine admiral and the first one to be revealed. He was nominated by Sengoku for the position of fleet admiral. However, after losing the position to Sakazuki, he resigned from the Marines and affiliated himself with the Blackbeard Pirates. He is a minor antagonist of the Long Ring Long Land Arc, and along with the other Marines, he is one of the major antagonists of the Marineford Arc.",
      "image":"http://pa1.narvii.com/6137/97b5a81a540d9cdaca1377378557442e465b9342_hq.gif"
    },
    {
      "title": "Sakazuki",
      "url": "http://onepiece.wikia.com/wiki/Sakazuki",
      "snippet": "Sakazuki, commonly known by his alias Akainu, is the current fleet admiral of the Marines, succeeding the previous fleet admiral, Sengoku. During the first half of the series, he was one of the three admirals, and the last one to be fully revealed. He ascended to the position of fleet admiral after defeating Kuzan in a ten-day duel that left Punk Hazard in its current state. One of his first decisions was to relocate the Marine Headquarters into the New World in preparation for the New Pirate Age.In the manga, he was first mentioned by Nico Robin during the initial encounter with Aokiji. In the anime, he was mentioned earlier by Vice Admiral Jonathan during the anime-only G-8 Arc, which aired after Akainu had been revealed in the manga.\n\nBecause of his actions, Akainu was one of the main antagonists of the Marineford Arc and after his promotion, he became one of the main antagonists of the series. Sakazuki is a strident follower of Absolute Justice, to the point where his extremism prompted an equally high-ranking colleague to resign from the Marines. He believes that a person's heritage is a reflection of how big of a threat they pose - a belief which caused him to target Portgas D. Ace and Monkey D. Luffy during the Battle of Marineford for the purpose of purging their \"bad blood\", which ultimately led him to personally kill Ace and attempt to kill Luffy, which he failed to do - managing only to leave a massive scar on his chest",
      "image":"http://25.media.tumblr.com/tumblr_m4uw34BPU01r18y5qo1_500.gif"
    },
    {
      "title": "Sengoku",
      "url": "http://onepiece.wikia.com/wiki/Sengoku",
      "snippet": "Sengoku the Buddha was the fleet admiral of the Marines pre-timeskip. He was the successor of Kong and the predecessor of Sakazuki. He was also one of the major figures along with Whitebeard, Shiki, and Monkey D. Garp during the times when Gol D. Roger was still alive, and still continues to be in the present, even after his resignation from the Marines. Sometime during the timeskip, he became an Inspector General. He raised Donquixote Rosinante like his own son. Due to his actions and his position in the Marines, he is one of the main antagonists of the Marineford Arc.",
      "image":"http://media.tumblr.com/tumblr_m5nvdhCXSP1qlkggu.gif"
    },
    {
      "title": "Dracule Mihawk",
      "url": "http://onepiece.wikia.com/wiki/Dracule_Mihawk",
      "snippet": "Dracule \"Hawk Eyes\" Mihawk is a member of the Shichibukai and the first one to be revealed in the series. He is also the current holder of the title, \"Greatest Swordsman in the World\". Mihawk served as Roronoa Zoro's swordsmanship master during the two-year timeskip. He is also a major antagonist in the Marineford Arc where he took part in the Battle of Marineford and sided with the Marines, along with most of the other Shichibukai.",
      "image":"http://66.media.tumblr.com/tumblr_mdela2uNVU1rxvxai.gif"
    },
    {
      "title": "Boa Hancock",
      "url": "http://onepiece.wikia.com/wiki/Boa_Hancock",
      "snippet": "\"Pirate Empress\" Boa Hancock is the captain of the Kuja Pirates and the only female member of the Shichibukai. She is the current empress, known as the the \"Snake Princess\", of Amazon Lily and rules over the Kuja tribe with her two younger Gorgon sisters, Boa Sandersonia and Boa Marigold. She is the main antagonist of the Amazon Lily Arc. She was first mentioned by the Risky Brothers at the end of the Thriller Bark Arc when comparing her legendary beauty to the beauty of mermaids. She is considered by many to be the most beautiful woman in the world.",
      "image":"https://lh3.googleusercontent.com/-KZidFRH9bgQ/V8n67C70llI/AAAAAAAALKU/UXohVvNPZ3sl5EWeXZobBdxXEVUhBfDRwCJoC/w800-h800/aeffa366827d2167f6da32f00ce36dc58b0529d6_hq.gif"
    },
    {
      "title": "Edward Weevil",
      "url": "http://onepiece.wikia.com/wiki/Edward_Weevil",
      "snippet": "Edward Weevil, or \"Whitebeard Jr.\", is the self-proclaimed son of Edward Newgate and one of the Shichibukai. His mother is Miss Bakkin, the self-proclaimed lover of Newgate. He was first mentioned by Commodore Brannew in a discussion of the current Shichibukai ranks to several high-ranking Marine officers, but was not explicitly named until after Donquixote Doflamingo's defeat.",
      "image":"http://vignette2.wikia.nocookie.net/onepiece/images/b/be/Edward_Weevil_Anime_Infobox.png/revision/latest?cb=20160818215009&path-prefix=pt"
    },
    {
      "title": "Crocodile",
      "url": "http://onepiece.wikia.com/wiki/Crocodile",
      "snippet": "Sir Crocodile is the former president of the mysterious crime syndicate Baroque Works and the main antagonist of the Alabasta Saga. He is one of the longest running and most noteworthy primary adversaries of the series, as he was the first enemy to hand Luffy a complete and utter defeat, as well as one of only two who has defeated Luffy more than once. He was originally introduced as a Shichibukai but was later stripped of his title after attempting to take control of the desert kingdom Alabasta. Thanks to Luffy, he managed to escape from Impel Down and went to Marineford to participate in the war; after that, he and Daz Bones decided to head out to the New World.",
      "image":"http://data1.whicdn.com/images/48081437/large.gif"
    },
    {
      "title": "Gekko Moriah",
      "url": "http://onepiece.wikia.com/wiki/Gekko_Moriah",
      "snippet": "Gekko Moriah was a member of the Shichibukai who resided on the largest ship in the world, Thriller Bark. His former bounty is Beli320,000,000. He is also the main antagonist of the Thriller Bark Saga who stole the shadows of Brook and various other beings with the power of the Kage Kage no Mi. He is also a major antagonist in the Marineford Arc where he took part in the Battle of Marineford and sided with the Marines, along with most of the other Shichibukai. Upon the war's end, he was stripped of his title and was to be eliminated by Donquixote Doflamingo, but managed to escape before he was killed, leaving Moriah's overall status unknown.",
      "image":"http://pa1.narvii.com/5746/a60c75d1f14344197bd8d71814bb91399ce6bc71_hq.gif"
    },
    {
      "title": "Smoker",
      "url": "http://onepiece.wikia.com/wiki/Smoker",
      "snippet": "Smoker the White Hunter is a Marine officer stationed at the G-5 base. He was first introduced as a captain in Loguetown, where he made it his mission to capture Luffy, and was later promoted to the rank of commodore, due to the events in Alabasta. At some point during the timeskip, he was promoted to the rank of vice admiral. Due to his actions against Luffy at Loguetown, Smoker can be considered as the main antagonist of Loguetown Arc.",
      "image":"http://pa1.narvii.com/5832/ef2bbd31f8c93e9158e964745ef5c14ce94a84e5_hq.gif"
    },
    {
      "title": "Bartholomew Kuma",
      "url": "http://onepiece.wikia.com/wiki/Bartholomew_Kuma",
      "snippet": "Bartholomew Kuma is a Shichibukai, formerly a Revolutionary with a bounty of Beli296,000,000. He was once feared as an extremely vicious pirate, earning himself the title, \"Tyrant\". He is a type of cyborg called \"Pacifista\" developed by Dr. Vegapunk. Once Vegapunk finished his modifications on Kuma, the Shichibukai was converted into the first complete Pacifista cyborg, with the serial PX-0, and figuratively died in the process. \n\nHe is also a major antagonist in the Marineford Arc where he took part in the Battle of Marineford and sided with the Marines, along with most of the other Shichibukai.",
      "image":"http://pa1.narvii.com/5704/359308ab1ef67ab39e8138d5d7e3c5698cc76f88_hq.gif"
    },
    {
      "title": "Emporio Ivankov",
      "url": "http://onepiece.wikia.com/wiki/Emporio_Ivankov",
      "snippet": "Emporio Ivankov, or Iva for short, is the \"Queen\" of the Kamabakka Kingdom, known as \"Okama King\" and a \"Miracle Person\", and is one of the commanders of the Revolutionary Army. \n\nHe was formerly a prisoner of Impel Down kept in Level 5, living in a secret \"Okama Paradise\" in level 5.5, but has since returned to his post as Queen of Kamabakka Kingdom. He challenged Sanji to defeat his 99 masters of Newkama Kenpo for the secret of the \"attack cuisine\" and a boat, during the two year timeskip.",
      "image":"http://66.media.tumblr.com/01ec282a3b78c4c72a5968e2e06ab801/tumblr_n7v93wnIRm1s57tgdo4_500.gif"
    },
    {
      "title": "Inazuma",
      "url": "http://onepiece.wikia.com/wiki/Inazuma",
      "snippet": "Inazuma is a Revolutionary, originally from South Blue, and an okama who serves under Emporio Ivankov. Because of Ivankov's gender changing powers, Inazuma has appeared both as a man and as a woman.\n\nWhile Inazuma's appearance is different depending on his current gender, Inazuma's basic appearance is the same for both genders. Inazuma has clothes and hair that is orange on one side and is white on the other side. On top of Inazuma's forehead, there is a distinct lightning bolt shaped scar that goes over Inazuma's right eye. Usually Inazuma is seen with a glass of wine being held in his left hand, and sporting a particular pose, even while fighting, and even continues to hold the wine glass while using his Devil Fruit ability.\n\nAs a man, Inazuma has his glasses on regularly. His jaw and body are also quite rectangular in shape. As a woman, Inazuma wears her glasses on top of her forehead, her jaw and body are also more rounded in shape, and the scar seems to move more towards the right side of her head.\n\n He also has a noticeable habit of keeping his free hand out and flat besides him despite gender. It should also be noted that Inazuma is one of the few (if not the only) okama to be depicted in a relatively normal manner without any of the excessively flamboyant characteristics or Drag Queen dressing and make up (or actually, no make-up at all), prevalent amongst okamas in One Piece. ",
      "image":"http://i.makeagif.com/media/5-16-2016/BOaB7O.gif"
    },
    {
      "title": "Big Mom Pirates",
      "url": "http://onepiece.wikia.com/wiki/Big_Mom_Pirates",
      "snippet": "The Big Mom Pirates are a powerful pirate crew captained by Charlotte Linlin, one of the Yonko, and they are in control of the powerful nation of Totto Land, with their base of operations being Whole Cake Island. \n\nAlong with the Vinsmoke Family and their organization, the Big Mom Pirates serve as one of the main antagonist groups of the Totto Land Arc, and of the larger Yonko Saga.",
      "image":"http://3.bp.blogspot.com/-2CuXezQuYEk/UjHfpHpRgTI/AAAAAAAABE0/1Bct8SEjS6E/s1600/Big+Mom+flag.gif"
    },
    {
      "title": "Charlotte Linlin",
      "url": "http://onepiece.wikia.com/wiki/Charlotte_Purin",
      "snippet": "Charlotte Linlin, more widely known as Big Mom, is the captain of the Big Mom Pirates and the only female member of the Yonko. She is the matriarch of the Charlotte Family, which makes up the infrastructure of her crew, including herself and her dozens of children. She also rules over Totto Land as its queen, allegedly seeking to form it into an utopia where all the world's races can live together without experiencing discrimination or segregation. \n\nShe was the last Yonko to be named; her epithet was first mentioned just after the Battle of Marineford by Eustass Kid and her real name by Pappug on Fishman Island. Along with the Vinsmoke Family, she and her crew form the central antagonist groups in the Totto Land Arc.",
      "image":"https://65.media.tumblr.com/tumblr_md31xldmZE1r2sqylo2_500.gif"
    },
    {
      "title": "Yasopp",
      "url": "http://onepiece.wikia.com/wiki/Yasopp",
      "snippet": "Yasopp is the sniper of the Red Hair Pirates. He is the father of Usopp and the husband of Banchina.\n\nHe shares many personality traits with his son, including being able to encourage the rest of his crew to join in with his fun. He is very proud of his son, Usopp, to the point where he would often talk about his son over and over again to Luffy, which led Luffy to recognize Usopp on sight from Yasopp's stories alone. During his time in Luffy's village, Yasopp felt close to Luffy because he is the same age as his son whom he left at home.",
      "image":"http://40.media.tumblr.com/513546bc66b0a606a9b2697f00029192/tumblr_inline_nnacsjeoam1rrzcub_540.png"
    },
    {
      "title": "Grand Line",
      "url": "http://onepiece.wikia.com/wiki/Grand_Line",
      "snippet": "The Grand Line is the ocean current that is surrounded by the Calm Belts and follows an imaginary line that runs from north-west to south-east across the middle of the world and perpendicular to the Red Line. The Red Line is a vast continent that circles the globe from north-east to south-west. These two lines divide the rest of the Blue Sea into the Blues: North Blue, East Blue, West Blue, and South Blue.\n\n This stretch of ocean is said to be the most dangerous place in the world, and is commonly referred to as the Pirates' Graveyard by people from the four Blues because of this reputation. Those few pirate crews that make it to the second half of the Grand Line, known as \"the New World\", refer to the first half as \"Paradise\", showing it is all relative. Most believe that it is impossible to safely leave the Grand Line save at its beginning and end. However, the World Government regularly sends ships across the Calm Belts by coating their hulls with Seastone, rendering them invisible to the Sea Kings. The Grand Line is placed similarly to the equator. In fact the main importance of the Grand Line is that it is the only way to circumnavigate the globe. The Grand Line along with the Red Line are what seperate the 4 Blues and as such are key to worldwide trade and travel in that the Lines are placed along the pathes between the Blues. This makes them valuable routes of travel and obstacles for both pirates and civilians.\n\nDespite the reputation of the Grand Line being dangerous and chaotic, many normal people manage a living on individual islands regardless, having adapted to their home land. This indicates that it is actually traveling within the Line itself that is dangerous, as it virtually guarantees facing unpredictable climates and dangerous wildlife. However, there are also several islands, or portions of the islands, which are considered dangerous in their own right, and thus, they are either uninhabited or the citizens have taken precaution to the threat.",
      "image":"http://3.bp.blogspot.com/-qsuTJuV-fGg/TtxRLbgS9OI/AAAAAAAAADY/7VQviioMIq4/s1600/Grandline+Adventure.jpg"
    },
    {
      "title": "East Blue",
      "url": "http://onepiece.wikia.com/wiki/East_Blue",
      "snippet": "The East Blue is an ocean in the One Piece World and was the setting of the first six arcs of the manga and anime and the anime only Warship Island arc. East Blue, like its sister seas, comprises almost entirely of ocean, with a few scattered islands and a border called the Red Line. In One Piece Film: Strong World it is referred to by the citizens of Merveille as the Sea of Schemes. \n\nThe East Blue is commonly known as the weakest of all the seas. Pirates who are considered great and threatening in this sea are regarded as low rate compared to pirates from the other seas and especially in the Grand Line. The sea's weak status was demonstrated by Dracule Mihawk when he single-handedly took out every ship in Don Krieg's armada (except the flagship that was lucky enough to escape, which he later hunted down), recognized as the strongest fleet in the East Blue, when they tried to enter the Grand Line. Ironically, despite its poor fame, the East Blue was the birthplace of the most powerful pirate of all time, the late Pirate King Gol D. Roger, and many other powerful and world renowned characters, such as Monkey D. Dragon, Monkey D. Luffy and Roronoa Zoro.",
      "image":"http://storeonanimeonline.com/wp-content/uploads/2014/07/East_Blue_Infobox.png"
    },
    {
      "title": "Will of D.",
      "url": "http://onepiece.wikia.com/wiki/Will_of_the_D.",
      "snippet": "The \"Will of the D.\", or \"D.'s will\" is a mystery surrounding some people who have the middle initial \"D.\" in their names.\n\nThe initial was first pointed out in Oda's SBS questions and answers corner, when he was asked what the D. in Luffy's name stood for. Oda just replied to read it as a D. for now and that he would reveal the truth behind it in time This was the first time Luffy's \"D.\" was brought up, as well as Oda's first hint toward a bigger mystery.\n\nKureha was the first to mention the \"will of D.\" when she revealed that the true name of the late Pirate King was Gol D. Roger. She told Dalton that Chopper had joined up with a very dangerous man",
      "image":"http://www.onepiecegold.com/wp-content/uploads/2015/03/one_piece___knowing_will_of_d__by_uchiha275-d8343fs.jpg"
    },
    {
      "title": "Oro Jackson",
      "url": "http://onepiece.wikia.com/wiki/Oro_Jackson",
      "snippet": "The Oro Jackson was the ship made by Tom for Gol D. Roger and the Roger Pirates. It is the only ship that has sailed to the end of the Grand Line.\n\nThe Oro Jackson was made from wood hewn from the treasure tree \"Adam\", the same wood is used during the creation of the Thousand Sunny, the ship that belongs to the Straw Hat Pirates. The figurehead of the ship appears to be a pair of mermaids alongside a forward facing cannon. The ship had three masts, with red sails and a jolly roger on the foremast. The sails also have a vertical stripe design.",
      "image":"http://kaizu.land/attachment.php?attachmentid=90082&stc=1&d=1406001857"
    },
    {
      "title": "Thousand Sunny",
      "url": "http://onepiece.wikia.com/wiki/Thousand_Sunny",
      "snippet": "The Thousand Sunny is the second ship of the Straw Hat Pirates, built after the Going Merry was destroyed. She is a brig sloop type ship designed and built by Franky with help from Yokozuna, Iceburg, and the remaining Galley-La foremen. Built from Adam Wood, she is a magnificent ship at least double the size of the Going Merry. Her features include practically all of the various requests the Straw Hats had before arriving in Water 7.\n\nThe Thousand Sunny is a brig sloop, a type of ship that relies on the skills of its navigator. The ship has a lawn on her deck, complete with a swing and a slide, as well as an observation tower for a crow's nest. The huge masts give the ship extreme maneuverability. Like the Going Merry, the figurehead is an animal's head, specifically a lion with a stylized mane. Due to the mane's ambiguity, the lion was mistaken for both a sunflower and a sun during the ship's construction, much to Franky's frustration. The ship holds sixteen cannons: seven traditional cannons on each side of the ship and two specialized air cannons— the Gaon Cannon in the figurehead and the Coup de Burst cannon astern.",
      "image":"http://3.bp.blogspot.com/-uHJrR6lZ0sI/TVPVACUtewI/AAAAAAAADr8/3xxM8-e-z3Q/s1600/Thousand_Sunny.png"
    },
    {
      "title": "Going Merry",
      "url": "http://onepiece.wikia.com/wiki/Going_Merry",
      "snippet": "The Going Merry was the first ship of the Straw Hat Pirates that they used as their main mode of transportation through the East Blue all the way to Water 7, where it was succeeded by the Thousand Sunny. It is a caravel class ship designed by Merry and given by Kaya to the Straw Hats as a reward for saving her. Over time, the ship came to be loved by the crew as a home and as a friend, so much so that she literally took on a life of her own and became just as much a part of the crew as any of them. Unfortunately, the Going Merry took an inordinate amount of damage during her \"lifetime\", being blown up, impaled, and even sliced up multiple times. Eventually, the Going Merry could no longer continue and received a Viking funeral.",
      "image":"http://66.media.tumblr.com/tumblr_lrqi00s0yi1qktt6u.gif"
    },
    {
      "title": "Wano Country",
      "url": "http://onepiece.wikia.com/wiki/Wano",
      "snippet": "The Wano Country is a nation in the New World. It is a country not affiliated with the World Government and is currently being occupied by the Beasts Pirates. \n\n Wano Country has its own warriors, the samurai, who are swordsmen so strong that not even the Marines go near them.\n\nWomen from Wano are expected to be modest and speak gracefully and quietly. In addition, the chonmage is a common hairstyle.\n\nThe country follows a policy of isolationism, meaning that contact with outsiders such as pirates and other countries is prohibited. Leaving the country's borders is also considered a crime.",
      "image":"http://vignette1.wikia.nocookie.net/onepiece/images/c/ca/Wano_Country_Infobox.png/revision/latest?cb=20140801103451"
    },
    {
      "title": "Impel Down",
      "url": "http://onepiece.wikia.com/wiki/Impel_Down",
      "snippet": "Impel Down, also known as The Underwater Prison, is a government-controlled stronghold in Paradise together with Marine Headquarters and formerly, Enies Lobby. It is the World Government's maximum-security prison for the most dangerous criminals and pirates. It is located underwater in the middle of the Calm Belt. \n\nImpel Down is the main setting of the Impel Down Arc.",
      "image":"https://secure.static.tumblr.com/27ad2659e6f259d5bf4eee412ce1479e/fxjjahe/XhUn3qg60/tumblr_static_af128or6rc0k0ssws44k4w88c.jpg"
    },
    {
      "title": "Raizo",
      "url": "http://onepiece.wikia.com/wiki/Raizo",
      "snippet": "Raizo of the Mist is a ninja from Wano Country, a comrade of Kin'emon and Kanjuro, and a retainer of the Kozuki Family. \n\nDue to his connection to the Kozuki Family, the Beasts Pirates hunted him down for over two weeks and even went as far as to torture Zou's citizens to flush him out.",
      "image":"https://i.ytimg.com/vi/vRjhlRsB0_0/maxresdefault.jpg"
    },
    {
      "title": "Raftel",
      "url": "http://onepiece.wikia.com/wiki/Raftel",
      "snippet": "Raftel is the island at the end of the Grand Line which supposedly holds the treasure One Piece.\n\n There are four poneglyphs known as Road Poneglyphs that, when read together, lead to four islands which, if aligned, will lead to Raftel's location. One of these is located on Zou, one is at an unknown location, and the last two are each owned by the Yonko Kaido and Charlotte Linlin.\n\nIt is said that upon reaching Raftel, if one has taken with them along their journey the passages of the poneglyphs, then the Rio Poneglyph will finally be revealed. Furthermore, the Road Poneglyphs, a set of four special red poneglyphs, each reveal a point on a map of the world once read. When all four points are deciphered, it becomes possible to discern the place at the center of these points where they all intersect, and the true path to Raftel will be made known",
      "image":"http://yudesigns.net/wp-content/uploads/2013/04/Raftel.png"
    },
    {
      "title": "Poneglyphs",
      "url": "http://onepiece.wikia.com/wiki/Poneglyph",
      "snippet": "Poneglyphs are mysterious stone blocks with history inscribed on them in the form of strange letters. They are scattered among the islands of the world, and it is said the only person left in the world who can read them is Nico Robin. \n\nPoneglyphs are massive blocks made of an indestructible type of stone. They have text carved on them, written in an ancient language.\n\nThere are a total of three types of poneglyphs within the series; Historical, Instructional and Road Poneglyphs. \"Historical Poneglyphs\" reveal pieces of ancient history as well as messages written by ancient people. \"Instructional Poneglyphs\" contain instructions and/or clues about the locations of Historical Poneglyphs and Ancient Weapons. Both Historical and Instructional Poneglyphs are of a dark blue color. The third and last type of poneglyph is the \"Road Poneglyph\", which gives away a location that, when pieced together with the locations given by the other Road Poneglyphs, allows one to find the path to Raftel. Those poneglyphs are of a deep red color and there are only a total of four of them.",
      "image":"https://i.ytimg.com/vi/Es4ip-4G_go/hqdefault.jpg"
    },
    {
      "title": "Mink Tribe",
      "url": "http://onepiece.wikia.com/wiki/Mink",
      "snippet": "The Mink Tribe is a race in the One Piece world. They were first mentioned in the list of slave prices that Duval showed to Sanji. They live in the Mokomo Dukedom on top of Zou, and have largely remained isolated from other human civilizations for 1000 years.\n\nMinks are humanoids with animal features. Similar to fishmen and merfolk, each individual takes after a specific animal. So far, the animalistic traits of the minks have all been fur-covered mammalian. As such, fur, which they also refer to as \"mink\", covers most of their bodies and is considered their pride and joy. Females tend to look more like humans while males tend to look more bestial. They possess humanoid hands and feet, but those based on animals with paws will also possess paw pads on their palm and up to their first knuckle.",
      "image":"http://img08.deviantart.net/9f7a/i/2015/302/d/a/one_piece_mink_man_carrot_and_wanda__colored_by_arcxana-d9etoua.png"
    },
    {
      "title": "Fishman Island",
      "url": "http://onepiece.wikia.com/wiki/Fishman_Island",
      "snippet": "Fishman Island is the home of the fishmen and merfolk. It serves as an underwater gateway to the New World for those who do not wish (or are not legally permitted) to cross over the Red Line above.\n\nThis was the last island the Straw Hats visited before arriving at the New World. It has also been prophesied by Madam Shyarly that they, or at least their captain Monkey D. Luffy may one day return and destroy the island.",
      "image":"http://data.whicdn.com/images/190391312/large.png"
    },
    {
      "title": "Fishmen",
      "url": "http://onepiece.wikia.com/wiki/Fishmen",
      "snippet": "Fishmen are one of two humanoid species that inhabit and rule the seas (the other being the merfolk). In terms of leadership, King Neptune is the king of Fishman Island. Fisher Tiger, Jinbe, and Arlong were said to have the highest respect amongst their people. They are classified as Type C creatures, \"Big Savage\".\n\nFishmen are more fish-like than merfolk, usually looking like a combination between a man and a fish or other aquatic creature, such as an octopus, manta ray, or sawshark; however, they still have legs. They also have gills between their shoulders and necks, sometimes covered by their clothing, as well as often having webbed hands. Depending on species, they may have multiple limbs (mainly extra arms).",
      "image":"http://www.desktopimages.org/pictures/2014/0514/1/one-piece-anime-fishman-wallpaper-521393.jpg"
    },
    {
      "title": "Merfolk",
      "url": "http://onepiece.wikia.com/wiki/Merfolk",
      "snippet": "Merfolk are one of the two major races that inhabit the sea (the other being the Fishmen). Both races are ruled by the Great Knight of the Sea, King Neptune.\n\nMerfolk are one of the two major races that inhabit the sea (the other being the Fishmen). Both races are ruled by the Great Knight of the Sea, King Neptune.\n\nLike the mermaids and mermen of folklore, their upper half is that of a human while the lower half is that of a fish or other undersea creature. As demonstrated by Kokoro, mermaids may walk normally on land as when they are thirty years old, their tails split into two. Like the fishmen, they are based on the different fish of the sea; for example, Kokoro is an ice fish mermaid and Hyouzou of the New Fishman Pirates is a poisonous blue-ringed octopus merman. Two mermaids of a similar species can also have very different looks; such as Mero and Shirahoshi, who are both smelt-whiting Mermaids.",
      "image":"http://3.bp.blogspot.com/-wPKkDYxPHvg/TusyOb_kOEI/AAAAAAAAEJU/wxEJ8Cx5z9A/s1600/vlcsnap-111647.png"
    },
    {
      "title": "Kozuki Oden",
      "url": "http://onepiece.wikia.com/wiki/Kozuki_Oden",
      "snippet": "Kozuki Oden was the daimyo of Kuri in Wano Country and was Momonosuke's father. He was also a member of the Roger Pirates and Whitebeard Pirates.\n\nDue to the loyalty of their rulers, all the minks on Zou respect Oden and the Kozuki Family enough to sacrifice their lives for one of their retainers.\n\nOden cared deeply for his clan as he sacrificed himself to enable his son and retainers to escape the Beasts Pirates. Kin'emon, Kanjuro, Raizo, and Momonosuke were shown grieving over his death.\n\nIt is known that he had a wife and a son, this one being Momonosuke. His wife was also murdered by the Beasts Pirates.\n\nInuarashi and Nekomamushi\n\nAs retainers, Inuarashi and Nekomamushi are very loyal to Oden. However, when Momonosuke saw Inuarashi and Nekomamushi, he questioned whether Oden was the reason for their bitterness toward each other. Momonosuke claimed that his father would be saddened if he saw them fighting, a remark that caused the two to reconcile their feud, showing their respect toward his father.",
      "image": "http://www.fakingnews.firstpost.com/wp-content/uploads/2015/01/default.png"
    },
    {
      "title":"Shirahoshi",
      "url":"http://onepiece.wikia.com/wiki/Shirahoshi",
      "snippet":"Princess Shirahoshi, also known as the Mermaid Princess, is a giant smelt-whiting mermaid and the youngest of King Neptune's children. She was first mentioned by Pappug, claiming he knew her and even promised to introduce the Straw Hat Pirates to her when they arrived on Fishman Island (though later this is revealed to be a lie). She is also the current form of Poseidon, an Ancient Weapon.",
      "image":"http://www.onepiecegold.com/wp-content/uploads/2015/06/shirahoshi-mermaid-one-piece-wallpaper-1920x1200.jpg"
    },
    {
      "title":"Ancient Weapons",
      "url": "http://onepiece.wikia.com/wiki/Ancient_Weapons",
      "snippet":"The Ancient Weapons are three weapons capable of mass destruction, each taking a different form. They are known as Pluton, Poseidon, and Uranus, each named after a deity for their godly powers. The weapons are not limited only to inanimate objects, but consist of living beings as well. \n\nThe Ancient Weapons are the argument used by the World Government to forbid research of the Void Century, since they fear that knowledge of the weapons could result in a global war. However, this has not stopped members of the World Government, most notably Spandam and former Shichibukai Crocodile, from attempting to gain one of the weapons for themselves. Even without knowledge of the missing years, their power has been known to entice casual observers (as was the case with Vander Decken IX's interest in Shirahoshi, otherwise known as the Ancient Weapon Poseidon).",
      "image":"http://pre02.deviantart.net/df4a/th/pre/f/2011/347/3/7/poseidon___the_ancient_weapon_by_deiviscc-d4j22ny.jpg"
    },
    {
      "title":"Zeff",
      "url":"http://onepiece.wikia.com/wiki/Zeff",
      "snippet":"Zeff is the head chef and owner of Baratie, former captain of the Cook Pirates (in which he was known as \"Red-Leg\"), and is also Sanji's mentor.\n\nWhile Zeff was always harshly critical towards Sanji, he did this to make Sanji into the great chef and tough fighter he is now. Despite objecting to it at first, Sanji seems to come to understand what Zeff was up to. In a way, Sanji is like a son to Zeff; it was Zeff who practically raised Sanji like his own father, including helping him develop his cooking skills and teaching him the value of of a cook's hands. Sanji's signature fighting style was developed as a result of this teaching, which included Zeff beating him up whenever he threatened his hands in combat.",
      "image":"http://onepiece-treasurecruise.com/en/wp-content/uploads/c0052.png"
    },
    {
      "title":"Void Century",
      "url":"http://onepiece.wikia.com/wiki/Void_Century",
      "snippet":"The Void Century is a century-long gap in recorded and archaeological history, the study of which is forbidden by the World Government. These events occurred 900 to 800 years before the current storyline. It was hinted at during the Skypiea arc; the dates were seen in Robin's flashback.\n\nThis period became known as the Void Century because there is nothing left to acknowledge anything that happened in it, aside from the poneglyphs which are written in a language that few know how to read.\n\nHowever, it causes a problem with the known histories of the world as nothing ties up because of that missing period. Though many seem to know there is a gap in the historical record, virtually everyone is unaware that filling in this gap is possible. For example, Nefertari Cobra, after being told by Nico Robin about this missing period, was completely shocked that a way to \"tie the threads of history together\" existed. The fact that filling the gap is possible was proven when \"Dark King\" Silvers Rayleigh revealed that the Roger Pirates discovered the true history.",
      "image":"http://www.fakingnews.firstpost.com/wp-content/uploads/2015/01/default.png"
    },
    {
      "title":"Pekoms",
      "url":"http://onepiece.wikia.com/wiki/Pekoms",
      "snippet":"Pekoms is a combatant of the Big Mom Pirates and a lion mink. He is partnered with Tamago, and both are responsible for collecting the monthly payment of sweets from Fishman Island in exchange for Big Mom's protection.",
      "image":"http://25.media.tumblr.com/tumblr_mdcaxmzUFB1rgryomo1_500.gif"
    },
    {
      "title":"Skypiea",
      "url":"http://onepiece.wikia.com/wiki/Skypiea",
      "snippet":"Skypiea is an island located in the sky above Paradise. It is the primary setting of the Skypiea Arc, and the sixth island visited by the Straw Hat Pirates on the Grand Line.\n\nThe people in there have small wings on their backs, similar to the stereotypical angel which make them really unique, though no use has been revealed for them thus far. The daily life of sky people revolves around the use of Dials, which normally are not available in the Blue Sea. As opposed to the belly of the rest of the world, it uses extols as currency. The people of Skypiea have a religious reverence for soil, because it can yield plant life much better than island cloud can, and also other materials that come from the Blue Sea. Most of the people from the Blue Sea believe that Skypiea is merely a myth.",
      "image":"http://onepiecegt.it/files//gallerie/tv/Ep_158/Ep158_001.jpg"
    },
    {
      "title":"Zou",
      "url":"http://onepiece.wikia.com/wiki/Zou",
      "snippet":"Zou is an island located on the back of a massive, 1000-year-old elephant named Zunisha that roams the New World. It is known as a \"Phantom Island\" due to Log Poses being unable to point to it. It is home to the Mink Tribe as well as where the Heart Pirates resided while waiting for their captain to return from Dressrosa. \n\nZou is the third island visited by the Straw Hats in the New World, and it is the primary setting of the Zou Arc.\n\nZunisha is a massive, living, and sentient elephant; as a result, it cannot be tracked by a Log Pose or Eternal Pose like regular islands can. Having walked through the New World for over 1000 years, Zunisha's body has been left damaged by time and the elements; its ears are torn, its eyes are sunken into its skull, and its skin is frail and weak. Its legs are very tall, making it difficult to scale the elephant and get onto the island.",
      "image":"http://dzt1km7tv28ex.cloudfront.net/u/638610426019446784_35s_d.jpg"
    },
    {
      "title":"Water 7",
      "url":"http://onepiece.wikia.com/wiki/Water_7",
      "snippet":"Water 7 is a city in Paradise known for its shipwrights. It is the main setting of the Water 7 Arc and Post-Enies Lobby Arc. The Straw Hat Pirates stopped here to trade in their gold for Belly, as well as to repair the Going Merry and also to find a new shipwright for their crew. It is part of the route their log was on, heading there directly after Long Ring Long Land, making it the eighth island in Paradise that they visited.\n\nWater 7 is slowly sinking. The current group of houses is built on top of the last group from at most a couple decades before.\n\nWater 7 used to be on dry land, while Shipyard Island would be outside of the city. However, as centuries went by, as the water began to rise, the people of Water 7 would build new houses and buildings on top of the older buildings to survive.\n\nGenerations ago, the ancient weapon Pluton was constructed here, before it was shipped off to Alabasta. The Blueprint, however, remained in Water 7 for generations.\n\nGol D. Roger visited this city, the fishman shipwright Tom built him his ship, Oro Jackson.",
      "image":"http://f.ptcdn.info/100/027/000/1420270650-WaterSeven-o.jpg"
    },
    {
      "title":"Alabasta",
      "url":"http://onepiece.wikia.com/wiki/Alabasta",
      "snippet":"Alabasta Kingdom is a desert kingdom in Paradise. It was the fourth island that the Straw Hat Pirates visited on the Grand Line, and the events here resulted in Luffy's bounty being raised to Beli100,000,000, and Zoro acquiring a bounty of Beli60,000,000. It is where the poneglyph showing the location of Pluton is located, and is one of the twenty founding countries of the World Government.",
      "image":"http://cdn.mos.cms.futurecdn.net/8cc3625306ada450f251e9fdd8f1e5b0-650-80.png"
    },
    {
      "title":"Dressrosa",
      "url":"http://onepiece.wikia.com/wiki/Dressrosa",
      "snippet":"Dressrosa is a kingdom within the New World, and one of the Twenty Kingdoms of the World Government. It was first mentioned by Vergo. Dressrosa is the second island visited by the Straw Hat Pirates in the New World and the primary setting of the Dressrosa Arc.\n\nDressrosa is one of the Twenty Kingdoms that were responsible for founding the World Government after the defeat of the Great Kingdom. It is located in the New World",
      "image":"http://pm1.narvii.com/5886/65acd2006f2b1da2c75c79830b0db9f929ce2848_hq.jpg"
    },
    {
      "title":"Punk Hazard",
      "url":"http://onepiece.wikia.com/wiki/Punk_Hazard",
      "snippet":"Punk Hazard is an island located in the New World and is the first island the Straw Hat Pirates disembark on (after receiving a distress call from someone on the island) after arriving in the New World. According to Trafalgar Law, it is an island that is not possible to \"log\". It is where Akainu and Aokiji battled for the position of fleet admiral for ten days. The island is relatively close to Dressrosa, as travel between the two islands can be performed in a short period of time. It is the main setting of the Punk Hazard Arc.\n\nThe island is surrounded by a sea of fire on one side and icebergs on the other. In the center, there is a hole where seawater flows into it, which separates both halves of the island and has sharks living within. This hole has fierce wind and currents running across it. As touched upon by Robin, the extreme temperature differences between the ice and magma lead to an equally extreme difference in air pressure, forming massive gale-force winds. The lake was originally a crater formed at the epicenter of Akainu and Aokiji's death match and then later filled with seawater, though the aftermath of the duel did leave behind patches of burning and frozen waters in the lake. The entrance is bolted with a danger sign, hazard stripes, and the logos of the Marines and World Government. The external border is heavily fenced in and inside lies a military base.",
      "image":"http://www.onepiecez.com/wp-content/uploads/2013/01/One-Piece-579-Anime-Screenshot-Punk-Hazard-Entrance-Sign-1024x576.png"
    },
    {
      "title":"Marines",
      "url":"http://onepiece.wikia.com/wiki/Marines",
      "snippet":"The Marines are the World Government's military sea force, tasked with law enforcement, international security and military operations. The Marines are one of the three great powers, alongside the Shichibukai and the Yonko.\n\nThey are present in all the seas around the world, as evidenced by their branch offices. The focus of their assets is on the far more dangerous Grand Line.\n\nIn the aftermath of the Battle of Marineford, the base of operations for Marine Headquarters has since been relocated to the New World.\n\nDue to their actions overall, they are one of the main antagonists of the series.",
      "image":"http://pm1.narvii.com/5644/128e50a10ae67922de67426a49203b631ee63638_hq.jpg"
    },
    {
      "title":"Tom",
      "url":"http://onepiece.wikia.com/wiki/Tom",
      "snippet":"Tom was a powerful long-horned cowfish fishman, known as the most skilled shipwright in the world. He was the head of his own company, Tom's Workers. He was also Iceburg and Franky's teacher and Den's older brother. Furthermore, he was well known for being the builder of the Roger Pirates' ship, the Oro Jackson.",
      "image":"http://onepiece-treasurecruise.com/en/wp-content/uploads/c0848.png"
    },
    {
      "title":"Iceburg",
      "url":"http://onepiece.wikia.com/wiki/Iceburg",
      "snippet":"Iceburg is the president of the Galley-La company and the mayor of Water 7. He is formerly one of Tom's Workers.\n\nIceburg was the one who gave him the nickname \"Franky\" because he thought Cutty Flam was a weird name; later, when he passed on the Pluton blueprints, he was the one who asked Franky to use only that name to protect himself from anyone who would want to steal the plans. His relationship with Franky is strange at times as he has never really understood Franky's often weird antics, and Franky was prone to calling him \"Baka-berg\" or \"Ahoberg\" at times, \"Baka\" and \"Aho\" being the Japanese words for \"idiot\" or \"moron\" or something similar; the English dub changed this to \"Ice for brains\". Likewise, Iceburg called him \"Bakanky\", a portmanteau of \"Baka\" and \"Franky\", changed to \"Flunky\" in the English dub. His original goal to build a ship strong enough to kill a Sea King was always shunned by Iceburg who did not understand why he kept building his weird and potentially dangerous ships. When the Battle Franky's were used to hurt the innocent, Iceburg was very angry at Franky. Since then, however, Iceburg has forgiven Franky for the part his Battle Frankys played in the framing of Tom, and despite the differences between Iceburg and Franky, the two former apprentices of Tom are the best of friends; Iceburg was relieved to the point of tears to find out Franky was alive after he was hit by the Sea Train, and likewise, Franky was enraged with CP9 after they told him Iceburg was supposedly dead. Iceburg was also the only person aware that Franky's grief towards Tom's death was the real reason behind Franky's actions in Water 7 and why he refused to leave. In the end, Iceburg was able to help Franky overcome that grief by helping him realize he needed to forgive himself, enabling Franky to join the Straw Hat Pirates. ",
      "image":"https://img.buzzfeed.com/buzzfeed-static/static/2014-11/9/7/enhanced/webdr05/anigif_enhanced-28322-1415534459-1_preview.gif"
    },
    {
      "title":"Vinsmoke Family",
      "url":"http://onepiece.wikia.com/wiki/Vinsmoke_Family",
      "snippet":"The Vinsmoke Family is a powerful and infamous family of Underworld killers, and the family from which Sanji hails. They are also the reigning royal family of the Germa Kingdom, as well as the former dynastic conquerors and rulers of North Blue. As an adjunct to their rule over the Germa Kingdom, they are the commanders of the Kingdom's Underworld army, Germa 66. \n\nAlongside their organization, Big Mom and her crew, the Vinsmoke Family is one of the main antagonist groups of the Totto Land Arc.",
      "image":"http://orig04.deviantart.net/7dc3/f/2016/157/b/d/vinsmoke_family_from_one_piece_by_sogeflocolo-da575uy.png"
    },
    {
      "title":"Enies Lobby",
      "url":"http://onepiece.wikia.com/wiki/Enies_Lobby",
      "snippet":"Enies Lobby, also known as The Judicial Island, was a government-controlled stronghold in Paradise together with the Marine Headquarters and Impel Down, and the headquarters of CP9. Enies Lobby is located on an island referred to as both the \"afternoon island\" and the \"never-night island\".\n\nEnies Lobby led to Impel Down and the Marine Headquarters directly. Because of this, there were many government agents stationed there, roughly 10,000 men, a mix of those from both the World Government and the Marines. The island also had a courthouse, which made it easy to transfer high-level criminals through Enies Lobby and directly into Impel Down, or to the Marine Headquarters. Due to recent events, the island has been completely annihilated and left in ruins due to the effects of a Buster Call. It is unknown if it was rebuilt during the time skip.",
      "image":"http://pm1.narvii.com/5796/0cfc4af468585ebfd70fcd8d9b2909e0bb982862_hq.jpg"
    },
    {
      "title":"CP9",
      "url":"http://onepiece.wikia.com/wiki/Cp9",
      "snippet":"CP9, more properly known as Cipher Pol Number 9, is a \"secret\" Cipher Pol organization, formed of people able to use the Rokushiki techniques. They are the main antagonists of the Water 7 and Enies Lobby Arcs.\n\nUnlike the eight official Cipher Police groups, CP9 members are not based on intelligence gathering, but instead are shadowy assassins who kill anyone that opposes the World Government. Members are gathered at childhood, and are trained both physically and mentally to become powerful killers, discarding emotions in order to become more efficient in missions. Rob Lucci, the most powerful member in the organization's history, had become almost incapable of giving mercy or accepting weakness due to this; Kaku, on the other hand, was regretful that he had to abandon his undercover life in order to continue his duties, proving the mind-molding is not always successful.",
      "image":"https://i.ytimg.com/vi/De45TfVJvDg/maxresdefault.jpg"
    },
    {
      "title":"Pluton",
      "url":"http://onepiece.wikia.com/wiki/Pluton",
      "snippet":"Pluton is one of the three Ancient Weapons, alongside Poseidon and Uranus. Pluton is a huge warship capable of mass destruction, constructed long ago in the city of Water 7 in the Grand Line. It is said to be capable of destroying whole islands. Pluton was first mentioned by Crocodile when he questioned Nefeltari Cobra of its whereabouts.\n\n It is supposed to be a large warship of some kind. Not much else is known about it.",
      "image":"http://www.fakingnews.firstpost.com/wp-content/uploads/2015/01/default.png"
    },
    {
      "title":"Uranus",
      "url":"http://onepiece.wikia.com/wiki/Uranus",
      "snippet":"Uranus is one of the three Ancient Weapons that existed during the Void Century along with Poseidon and Pluton. It was first mentioned during Nico Robin's conversation with King Neptune, when she says there are three ancient weapons that bear the names of 'gods'. \n\n Like Pluton and Poseidon, Uranus is a dangerous weapon which can be used to rule the world or, in the wrong hands, destroy it. But as of yet, absolutely nothing else is known about it.\n\nUranus was a weapon known to have existed during the Void Century. Its actions during this point in history and what became of it since currently remains unknown.",
      "image":"http://www.fakingnews.firstpost.com/wp-content/uploads/2015/01/default.png"
    }
  ]
}
