{
  "items": [
    {
      "title": "Gum Gum Fruit",
      "japanese":"Gomu Gomu no mi",
      "type": "Paramecia",
      "url": "http://onepiece.wikia.com/wiki/Gomu_Gomu_no_Mi",
      "image":"https://images-na.ssl-images-amazon.com/images/I/61aa5GduiDL._SY355_.jpg",
      "snippet":"The Gomu Gomu no Mi is a Paramecia-type Devil Fruit that gives the user's body the properties of rubber, making the user a Rubber Human. It was originally a treasure that Shanks and his crew took from an unspecified enemy, but was accidentally eaten by the series protagonist Monkey D. Luffy. In the second version of Romance Dawn, it originally belonged to Luffy's grandpa who took it from an unspecified enemy.",
      "strength":"",
      "weakness":"",
      "current":"Monkey D. Luffy",
      "former":""
    },
    {
      "title": "Human-Human Fruit",
      "japanese":"Hito Hito no Mi",
      "type":"Zoan",
      "url": "http://onepiece.wikia.com/wiki/Hito_Hito_no_Mi",
      "image": "http://g02.a.alicdn.com/kf/HTB1aTb_JpXXXXaqXXXXq6xXFXXXw/J-G-Chen-Anime-One-Piece-Edward-Newgate-Seismic-Shock-Fruit-Human-Human-Fruit-PVC-Action.jpg",
      "snippet":"The Hito Hito no Mi is a Zoan-type Devil Fruit that allows its user to transform into a human hybrid and a full human at will. It was eaten by Tony Tony Chopper.",
      "strength":"",
      "weakness":"",
      "current":"Tony Tony Chopper"
    },
    {
      "title": "Revive Revive Fruit",
      "japanese":"Yomi Yomi no Mi",
      "type":"Paramecia",
      "url": "http://onepiece.wikia.com/wiki/Yomi_Yomi_no_Mi",
      "image": "http://i.imgur.com/KrGr1pz.png",
      "snippet":"The Yomi Yomi no Mi is a Paramecia-type Devil Fruit which enhances the user's soul to the point where they can come back to life after dying once, remaining alive until their body is sufficiently damaged, and to use several other soul-based abilities, making the user a Reviving Human. It was eaten by Brook.",
      "strength":"",
      "weakness":"",
      "current":"Brook"
    },
    {
      "title": "Mag-Mag Fruit",
      "japanese":"Magu Magu no Mi",
      "type":"Logia",
      "url": "http://onepiece.wikia.com/wiki/Magu_Magu_no_Mi",
      "image": "http://img1.wikia.nocookie.net/__cb20110426204650/onepiece/de/images/thumb/1/16/Magu_Magu_no_Mi_F%C3%A4higkeit.jpg/500px-Magu_Magu_no_Mi_F%C3%A4higkeit.jpg",
      "snippet":"The Magu Magu no Mi is a Logia-type Devil Fruit that allows the user to create, control, and transform into magma at will, turning the user into a Magma Human. It was eaten by Fleet Admiral Sakazuki, formerly known as Admiral Akainu.\n\nThe fruit's power was first shown during the Battle of Marineford, but was not named until it was revealed in SBS Volume 62.",
      "strength":"",
      "weakness":"",
      "current":"Sakazuki"
    },
    {
      "title": "Flame-Flame Fruit",
      "japanese":"Mera Mera no Mi",
      "type":"Logia",
      "url": "http://onepiece.wikia.com/wiki/Mera_Mera_no_Mi",
      "image":"https://images-na.ssl-images-amazon.com/images/I/614WxedD52L._SL1022_.jpg",
      "snippet":"The Mera Mera no Mi is a Logia-type Devil Fruit that allows the user to create, control, and transform into fire at will.\n\nThe Mera Mera no Mi is a round orange fruit, composed of many flame-shaped components with swirl patterns on each one, and has a swirled stem on the top. It is small enough to be held in one hand.\n\n",
      "strength":"",
      "weakness":"",
      "current":"Sabo",
      "former":"Portgas G Ace"
    },
    {
      "title": "Ice-Ice Fruit",
      "japanese":"Hie Hie no Mi",
      "type":"Logia",
      "url": "http://onepiece.wikia.com/wiki/Hie_Hie_no_Mi",
      "image":"http://1.bp.blogspot.com/-jkas44rmvb0/UfAUcLEuyzI/AAAAAAAAEFw/zg6ou_0-CUQ/s1600/hie+hie+no+mi.jpg",
      "snippet":"The chilly-Chilly Fruit is a Logia-type Devil Fruit that allows the user to create, control, and transform into ice at will, turning the user into a Freezing Human. It was eaten by Kuzan, better known as former Admiral Aokiji.",
      "strength":"",
      "weakness":"",
      "current":"Kuzan"
    },
    {
      "title": "Snow-Snow Fruit",
      "japanese":"Yuki Yuki no Mi",
      "type": "Logia",
      "url": "http://onepiece.wikia.com/wiki/Yuki_Yuki_no_Mi",
      "image":"http://1.bp.blogspot.com/-jkas44rmvb0/UfAUcLEuyzI/AAAAAAAAEFw/zg6ou_0-CUQ/s1600/hie+hie+no+mi.jpg",
      "snippet":"The Yuki Yuki no Mi is a Logia-type Devil Fruit that allows the user to create, control, and transform into the element of \"snow\" at will, turning the user into a Snow Human. The fruit was eaten by Monet, but with her death has returned to circulation.",
      "strength":"",
      "weakness":"",
      "current":"",
      "former":"Monet"
    },
    {
      "title": "Ton Ton Fruit",
      "japanese":"Ton Ton no mi",
      "type": "Paramecia",
      "url": "http://onepiece.wikia.com/wiki/Ton_Ton_no_Mi",
      "image":"http://vignette4.wikia.nocookie.net/onepiece/images/f/f6/Machvise_vs._Boo.png/revision/latest?cb=20150503134439&path-prefix=es",
      "snippet":"The Ton Ton no Mi is a Paramecia-type Devil Fruit which  allows the user to increase their weight, making them a Super Weight Human. It was eaten by Machvise. \n\nThe fruit's power was shown during the conflict of Dressrosa, but was not named until it was revealed in SBS Volume 79.",
      "strength":"",
      "weakness":"",
      "current":"Machvise",
      "former":""
    },
    {
      "title": "Pound Pound Fruit",
      "japanese":"Kilo Kilo no mi",
      "type": "Paramecia",
      "url": "http://onepiece.wikia.com/wiki/Kilo_Kilo_no_Mi",
      "image":"http://vignette2.wikia.nocookie.net/onepiece/images/4/4e/Crescendo_Stone.png/revision/latest?cb=20150414232758",
      "snippet":"The Kilo Kilo no Mi is a Paramecia-type Devil Fruit that allows the user to change their weight from 1 to 10,000 kilograms without, in any way, affecting the overall size of their bodies. It was eaten by Miss Valentine.",
      "strength":"",
      "weakness":"",
      "current":"Miss Valentine",
      "former":""
    },
    {
      "title": "Dark Dark Fruit",
      "japanese":"Yami Yami no mi",
      "type": "Logia",
      "url": "http://onepiece.wikia.com/wiki/Yami_Yami_no_Mi",
      "image":"http://2.bp.blogspot.com/-LfhAlSKD-1Y/VQ15vJAOrsI/AAAAAAAAFDY/-NIVELObPc0/s1600/yami1.jpg",
      "snippet":"The Yami Yami no Mi is a Logia-type Devil Fruit that allows the user to create and control darkness at will, making the user a Darkness Human. It was eaten by Marshall D. Teach, also known as Blackbeard, who stole it from Commander Thatch of the Whitebeard Pirates' 4th division. \n\n This fruit is considered \"unique\" even for a Logia type, and the ability it grants is said to be the \"most evil\".",
      "strength":"",
      "weakness":"",
      "current":"Marshall D. Teach",
      "former":""
    },
    {
      "title": "Glint Glint Fruit",
      "japanese":"Pika Pika no mi",
      "type": "Logia",
      "url": "http://onepiece.wikia.com/wiki/Pika_Pika_no_Mi",
      "image":"http://i.skyrock.net/1042/88091042/pics/3227660843_1_20_ZKgy121a.jpg",
      "snippet":"The Pika Pika no Mi is a Logia-type Devil Fruit that allows the user to create, control, and transform into light at will, turning the user into a Light Human. It enables the user to move at the speed of light and transport him/herself by means of reflection. It was eaten by Borsalino, better known as Admiral Kizaru.",
      "strength":"",
      "weakness":"",
      "current":"Borsalino",
      "former":""
    },
    {
      "title": "Op-Op Fruit",
      "japanese":"Ope Ope no mi",
      "type": "Paramecia",
      "url": "http://onepiece.wikia.com/wiki/Pika_Pika_no_Mi",
      "image":"http://g01.a.alicdn.com/kf/HTB1jNJ3IFXXXXXGXXXXq6xXFXXX1/205981656/HTB1jNJ3IFXXXXXGXXXXq6xXFXXX1.jpg",
      "snippet":"The Ope Ope no Mi is a Paramecia-type Devil Fruit that allows its user to create a spherical space or \"room\", in which the user has complete control over the placement and orientation of the objects inside, making the user a Free Modification Human. It was eaten by Trafalgar D. Water Law.\n\nThe fruit's power was first seen during the Sabaody Archipelago Arc, but the fruit itself was not named or explained in any way until the Punk Hazard Arc.\n\nThis fruit is called the \"Ultimate Devil Fruit\", because of its unique power to grant another person eternal youth in exchange for the current user's life. The Marines were willing to pay as much as Beli5,000,000,000 to buy the fruit from a pirate named Diez Barrels. The fruit is also renowned and coveted for allowing the user to perform miraculous surgeries to cure diseases without known cures and even circumvent physical disabilities.",
      "strength":"",
      "weakness":"",
      "current":"Trafalgar D. Water Law",
      "former":""
    }
  ]
}
